app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "SE"], ["room_number", 20], ["created_at", "2021-03-25 02:25:31.448134"], ["updated_at", "2021-03-25 02:25:31.448134"]]
---
    def create
        @sc = SchoolClass.new(school_class_params(:title, :room_number))
        @sc.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sc = SchoolClass.find_by(id: params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @sc = SchoolClass.find_by(id: params[:id])