app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @student = Student.find_by(id: params[:id])